<?php

namespace Database\Seeders;

use App\Models\Question;
use Illuminate\Database\Seeder;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public $questions = [
        [
            'text' => 'Название какой должности на стройке происходит от слова работа и производитель',
            'answer' => 'Прраб'
        ],
        [
            'text' => 'В какой стране в 1815 году к власти вернулась династия Бурбонов',
            'answer' => 'Франция'
        ],
        [
            'text' => 'У какого слова нет единственного числа, надои или обои',
            'answer' => 'обои'
        ],
        [
            'text' => 'Римсикими императорами, или арабскими халифами были абаситы',
            'answer' => 'арабсикими'
        ],
        [
            'text' => 'Как назывется восстановление организмомо утерянных тканей и органов',
            'answer' => 'Регинирация'
        ],
        [
            'text' => 'Норвежка Мари Бьерген была лыжнице или шахматисткой',
            'answer' => 'Лыжнецей'
        ],
        [
            'text' => 'в каком веке произошло стояние на Угре войск Ивана 3',
            'answer' => '15'
        ],
        [
            'text' => 'как в современной русской кухне называем макароны с измельченным мясов',
            'answer' => 'макароны по флотски'
        ],
        [
            'text' => 'Крупнейшим городом какой страны является Мумбаи',
            'answer' => 'Индия'
        ],
        [
            'text' => 'Как звали собаку за главную героиню рассказа Чехова',
            'answer' => 'Каштанка'
        ],
        [
            'text' => 'Артелирийские орудия пушки появились раньше или позже 17 века',
            'answer' => 'Раньше'
        ],
        [
            'text' => 'Отец какого призедента США был родом из Кении',
            'answer' => 'Обама'
        ],
        [
            'text' => 'Композитор Бетховен страдал глухотой или слепотой',
            'answer' => 'глухотой'
        ],
        [
            'text' => 'В какое море впадает западная двина',
            'answer' => 'Балтийское'
        ],
        [
            'text' => 'какому виду спорта посвящен американский фильм русская пятерка',
            'answer' => 'хоккей'
        ],
        [
            'text' => 'Какой металл надо ковать пока горячо согласно русской пословице',
            'answer' => 'железо'
        ],
        [
            'text' => 'Как называется отсров носивший прежде название Цейлон',
            'answer' => 'Шри-ланка'
        ],
        [
            'text' => 'В какой европейской стране находится регион Кастилия',
            'answer' => 'Испания'
        ],
        [
            'text' => 'Каким словом греческого происхождения называют стадию развития человека в утробе матери',
            'answer' => 'эмбрион'
        ],
        [
            'text' => 'Как называются беттонные стержни которые забивают в землю для последующего устройста основания здания',
            'answer' => 'Сваи'
        ],
        [
            'text' => 'У какого греческого бога была ревнивая жена Гера',
            'answer' => 'Зевс'
        ],
        [
            'text' => 'Сколько времени в Уфе когда в Москве час дня',
            'answer' => '3'
        ],
        [
            'text' => 'В какой стране находится город Инсбрук',
            'answer' => 'Австрия'
        ],
        [
            'text' => 'со сколькими странами Южная Корея граничит по суше',
            'answer' => '1'
        ],
        [
            'text' => 'чему равна половина развернутого угла',
            'answer' => '90'
        ],
        [
            'text' => 'С какой площадью Зимний дворец образует архитектурный ансамбль',
            'answer' => 'Дворцовая'
        ],
        [
            'text' => 'Высота или ширина водопада Виктория превышает 1 км',
            'answer' => 'Ширина'
        ],
        [
            'text' => 'Печенеги это славянский или тюрский народ',
            'answer' => 'тюрский'
        ],
        [
            'text' => 'На каком материке находится Марокко',
            'answer' => 'Африка'
        ],
        [
            'text' => 'В какой стране родился политик Пальмиро Тольяти',
            'answer' => 'Италия'
        ],
        [
            'text' => 'Валуй, козляк и ежовик это представители нечистой силы или грибов',
            'answer' => 'грибы'
        ],
        [
            'text' => 'Разновидность чего являются Баул и кофр',
            'answer' => 'Сумки'
        ],
        [
            'text' => 'По конституции глава государства в Германии президент или канцлер',
            'answer' => 'канцлер'
        ],
        [
            'text' => 'Без чего согласно популярному выражению не бывает дыма',
            'answer' => 'Без огня'
        ],
        [
            'text' => 'Лангуст это рыба или ракообразное',
            'answer' => 'ракообразное'
        ],
        [
            'text' => 'Назовите самое большое трехзначное число',
            'answer' => '999'
        ],
        [
            'text' => 'На каком языке написано первое предложения романа война и мир',
            'answer' => 'Французский'
        ],
        [
            'text' => 'Куриные яйца 1 или 3 категории крупнее',
            'answer' => '1'
        ],
        [
            'text' => 'Какого пророка послал бога сказать фараону отпусти народ мой',
            'answer' => 'Моисея'
        ],
        [
            'text' => 'Папоротники предпочитают освещенные или тенистые места',
            'answer' => 'тенистые'
        ],
        [
            'text' => 'Собор парижской богоматери или Колизей строили дольше',
            'answer' => 'Собор'
        ],
        [
            'text' => 'Какая часть глаза может ссужаться или расшираться в зависимости от освещения',
            'answer' => 'зрачок'
        ],
        [
            'text' => 'На правой или левой стороне располагаются пуговицы женской одежды',
            'answer' => 'левой'
        ],
        [
            'text' => 'какое растение дало название циклу из 250 картин клода моне',
            'answer' => 'кувшинки'
        ],
        [
            'text' => 'Высоту точки земной поверхности над уровнем море называют абсолютной или оптимальной',
            'answer' => 'абсолютной'
        ],
        [
            'text' => 'На сколько гос-в в налае 90-ых годов распалась чехословакия',
            'answer' => '2'
        ],
        [
            'text' => 'Сколько медведей изображено на картине Шишкина утро в сосновом лесу',
            'answer' => '4'
        ],
        [
            'text' => 'какая драгоценность образуется вокруг инородной частицы попавшей в раковину некорых малюсок',
            'answer' => 'жемчуг'
        ],
        [
            'text' => 'На какой площади получил ранение генерал Милорадович',
            'answer' => 'Сенатская'
        ],
        [
            'text' => 'Карбонара это разновидность пасты или супа',
            'answer' => 'пасты'
        ],
        [
            'text' => 'около 80 % территории крупнейшего острова покрыто льдами',
            'answer' => 'Гренландия'
        ],
        [
            'text' => 'Из баранины или говядины готовится классическое грузинское харчо',
            'answer' => 'говядина'
        ],
        [
            'text' => 'Сколько падежей грамматика насчитывает в русском языке',
            'answer' => '6'
        ],
        [
            'text' => 'больше или меньше миллиарда жителей в сша',
            'answer' => 'меньше'
        ],
        [
            'text' => 'В жанре поп или метал поет Дима Билан',
            'answer' => 'поп'
        ],
        [
            'text' => 'Кто согласно поговорке должын свистнуть, чтоб произошло что-то незбыточное',
            'answer' => 'Рак'
        ],
        [
            'text' => 'как назывется стаканчик для спиртых напитков и предметы положенные один на другой',
            'answer' => 'стопка'
        ],
        [
            'text' => 'Какой стране пренадлежит остров Сикоку',
            'answer' => 'Япония'
        ],
        [
            'text' => 'какя рыба в русской сказке исполняла желания Емели',
            'answer' => 'щука'
        ],
        [
            'text' => 'Сопрано это мужской или женский певчиский голос',
            'answer' => 'женский'
        ],
        [
            'text' => 'еденица измерения сопративления Ом это сокращенная фамилия ученого или фамилия целиком',
            'answer' => 'целиком'
        ],
        [
            'text' => 'В Казахстане или Узбекистане больше городов миллионников',
            'answer' => 'Казахстане'
        ],
        [
            'text' => 'Назовите единственный знак зодиака чье название начинается с буквы Л',
            'answer' => 'Лев'
        ],
        [
            'text' => 'Хиджаб это мужская или женская накидка',
            'answer' => 'женская'
        ],
        [
            'text' => 'Садовники или мебельщики называются краснодеревщики',
            'answer' => 'мебельщики'
        ],
        [
            'text' => 'какой овощь точная рифма к слову любовь',
            'answer' => 'морковь'
        ],
        [
            'text' => 'сколько острых углов в отсроугольном треугольнике',
            'answer' => '3'
        ],
        [
            'text' => 'Какого поэта считают центральной фигурой золотого века русской поэзии',
            'answer' => 'Пушкин'
        ],
        [
            'text' => 'двоичную или десятичную систему счисления мы применяем в повседневной жизни',
            'answer' => 'десятичную'
        ],
        [
            'text' => 'Назовите валюту Норвегии',
            'answer' => 'крона'
        ],
        [
            'text' => 'какие приборы бывают карманными, шахматными и солнечными',
            'answer' => 'часы'
        ],
        [
            'text' => 'В какой европейском столичном городе находится музей Вангога',
            'answer' => 'Амстердам'
        ],
        [
            'text' => 'На востоке какой страны шандумские горы',
            'answer' => 'Китай'
        ],
        [
            'text' => 'Какого цвета эритроциты',
            'answer' => 'красного'
        ],
        [
            'text' => 'в какое время суток предлагал ходить в гости Вини пух',
            'answer' => 'по утрам'
        ],
        [
            'text' => 'Как называется один из языков программирования Форсаж или Фортран',
            'answer' => 'Фортран'
        ],
        [
            'text' => 'Преобладанием лиственных или хвойных лесов харакетризуется тайга',
            'answer' => 'хвойных'
        ],
        [
            'text' => 'какой город обслуживает 4 из 5 самых загруженных аэропортов Великобритании',
            'answer' => 'Лондон'
        ],
        [
            'text' => 'Художесвтенно приуменьшение называется литота или алегория',
            'answer' => 'литота'
        ],
        [
            'text' => 'В первой или второй мировой войне учавствовал Василий Иванович Чапаев',
            'answer' => 'в первой'
        ],
        [
            'text' => 'форму какой гемоетрической фигуры имеет цирковой манеж',
            'answer' => 'круг'
        ],
        [
            'text' => 'из скольких цветов формировалось первое цветное изображение на телевидиние',
            'answer' => 'из 3'
        ],
        [
            'text' => '',
            'answer' => ''
        ],
        [
            'text' => '',
            'answer' => ''
        ],
        [
            'text' => '',
            'answer' => ''
        ],
        [
            'text' => '',
            'answer' => ''
        ],
        [
            'text' => '',
            'answer' => ''
        ],

    ];
    public function run()
    {
        foreach ($this->questions as $question) {
            Question::updateOrCreate($question);
        }
    }
}
